#+title: *Elisp---Emacs LISP*
#+AUTHOR: sugayu

** 条件分岐
- [[info:elisp#Conditionals][elisp#Conditionals]]

単純な条件分岐には ~if~ が使える。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (if t
      (message "Print this if True")
    (message "Print this if false"))
#+end_src

#+RESULTS:
:results:
Print this if True
:end:

~t~ のときのみの実行は ~when~ が使える。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (when t
    (message "Print this when True.")
    (message "Recieve sequential commands."))
#+end_src

#+RESULTS:
:results:
Recieve sequential commands.
:end:


複数の条件分岐には ~cond~ が使える。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (cond ((eq "a" "not a") "False")
        (t "True"))
#+end_src

#+RESULTS:
:results:
True
:end:

パターンマッチには ~pcase~ が使える。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (pcase "answer"
    (`answer 'ans)
    ((pred stringp) 'string)
    (_ 'fallback))
#+end_src

#+RESULTS:
:results:
string
:end:

- [[https://qiita.com/t-suwa/items/20a4ebf37b0a57ff88b2][Emacs：パターンマッチでスクレイピング #Emacs - Qiita]]

** リスト結合
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (append '(1 2 3) '(3 4 5))
#+end_src

#+RESULTS:
:results:
| 1 | 2 | 3 | 3 | 4 | 5 |
:end:

** リストの要素処理
要素の削除は ~delete~ (破壊的) か ~remove~ (非破壊的)。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (let* ((a '(2 3 4))
         (b '(2 3 4))
         (c (remove 3 b)))
    (delete 3 a)
    (append a '("/") b '("/") c))
#+end_src

#+RESULTS:
:results:
| 2 | 4 | / | 2 | 3 | 4 | / | 2 | 4 |
:end:

** 同一要素に対する処理
重複の無いリストにするには ~delete-dups~ (破壊的) か ~seq-uniq~ (非破壊的) を使う。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (let ((a '(2 3 4 6 6 3 7 2 4))
        (b '(2 3 4 6 6 3 7 2 4)))
    (delete-dups a)
    (seq-uniq b)
    (append a '("/") b))
#+end_src

#+RESULTS:
:results:
| 2 | 3 | 4 | 6 | 7 | / | 2 | 3 | 4 | 6 | 6 | 3 | 7 | 2 | 4 |
:end:

重複している要素をリストから除くには ~seq-difference~ が使える。
引数の順番は、前者のリストから後者に含まれるものを除く、を意味するので注意する。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (let ((a '(2 3 4 6 6 3 7 2 4))
        (b '(2 3 4 6)))
    (seq-difference a b))
#+end_src

#+RESULTS:
:results:
| 7 |
:end:

- 便利な関数は [[file:/usr/local/Cellar/emacs-mac@29/emacs-29.4-mac-10.1/Emacs.app/Contents/Resources/lisp/emacs-lisp/seq.el.gz][seq.el.gz]] に含まれていると思われる。

** 検索
文字列内の検索には ~string-match~ が正規表現とともに使える。
#+begin_src emacs-lisp :results raw drawer :eval never-export
  (remove nil
          (mapcar (lambda (buffer)
                    (when (string-match (format-time-string "%Yw...org") (buffer-name buffer))
                      (buffer-name buffer)))
                  (buffer-list)))
#+end_src

#+RESULTS:
:results:
| 2025w40.org | 2025w39.org |
:end:


